# data-database-types-relational-language-SQL-MySQL-CRU_D_-delete-command-DELETE
> [TABLE OF CONTENTS](https://nbviewer.jupyter.org/github/SeanOhAileasa/adb-MySQL/blob/main/adb-MySQL.ipynb#top)
***

- **remove** **existing** **rows** - records - tuples - from a **table** - entity - relation [1]

[MySQL Documentation](https://web.archive.org/web/20200524105929/https://dev.mysql.com/doc/refman/8.0/en/delete.html)

```sql
mysql> use lab5;
Database changed
```

```sql
mysql> show tables;
+----------------+
| Tables_in_lab5 |
+----------------+
| car            |
| person         |
+----------------+
2 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------------+------+------+-----------+
| personID | name        | age  | sex  | isStudent |
+----------+-------------+------+------+-----------+
|        1 | Mr.John     |   24 | M    |         1 |
|        2 | Ms.Mary     |   31 | F    |         0 |
|        3 | Mr.Tom      | NULL | M    |         0 |
|        4 | Mr.Alan     |   19 | M    |         1 |
|        5 | Ms.Laura    |   18 | F    |         1 |
|        6 | Mr.Bob      |   19 | M    |         0 |
|        7 | Mr.Johnny   |   24 | M    |         1 |
|        8 | Ms.Mary     |   31 | F    |         0 |
|        9 | Mr.Jonathan |   24 | M    |         0 |
|       10 | Mr.Tommy    |   24 | M    |         0 |
|       11 | Laura       |   17 | F    |         0 |
+----------+-------------+------+------+-----------+
11 rows in set (0.00 sec)
```

- row - record - tuple - Laura - signed up - at the age of seventeen she is too young - must **remove** from the database - **important** to **apply** a **constraint** **otherwise** **all** **rows** - records - tuples - in the **table** - entity - relation - will get **deleted** [1]

```sql
mysql> DELETE
    -> FROM person
    -> WHERE personID=11;
Query OK, 1 row affected (0.01 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------------+------+------+-----------+
| personID | name        | age  | sex  | isStudent |
+----------+-------------+------+------+-----------+
|        1 | Mr.John     |   24 | M    |         1 |
|        2 | Ms.Mary     |   31 | F    |         0 |
|        3 | Mr.Tom      | NULL | M    |         0 |
|        4 | Mr.Alan     |   19 | M    |         1 |
|        5 | Ms.Laura    |   18 | F    |         1 |
|        6 | Mr.Bob      |   19 | M    |         0 |
|        7 | Mr.Johnny   |   24 | M    |         1 |
|        8 | Ms.Mary     |   31 | F    |         0 |
|        9 | Mr.Jonathan |   24 | M    |         0 |
|       10 | Mr.Tommy    |   24 | M    |         0 |
+----------+-------------+------+------+-----------+
10 rows in set (0.00 sec)
```

```sql
mysql> SELECT *
    -> FROM person
    -> WHERE sex="M"
    -> AND isStudent
    -> AND age>20;
+----------+-----------+------+------+-----------+
| personID | name      | age  | sex  | isStudent |
+----------+-----------+------+------+-----------+
|        1 | Mr.John   |   24 | M    |         1 |
|        7 | Mr.Johnny |   24 | M    |         1 |
+----------+-----------+------+------+-----------+
2 rows in set (0.00 sec)
```

- delete all male students aged twenty-one and over - matching rows - records - tuples - deleted from the table - entity - relation [1]

```sql
mysql> DELETE
    -> FROM person
    -> WHERE sex="M"
    -> AND isStudent
    -> AND age>20;
Query OK, 2 rows affected (0.01 sec)
```

```sql
mysql> SELECT *
    -> FROM person;
+----------+-------------+------+------+-----------+
| personID | name        | age  | sex  | isStudent |
+----------+-------------+------+------+-----------+
|        2 | Ms.Mary     |   31 | F    |         0 |
|        3 | Mr.Tom      | NULL | M    |         0 |
|        4 | Mr.Alan     |   19 | M    |         1 |
|        5 | Ms.Laura    |   18 | F    |         1 |
|        6 | Mr.Bob      |   19 | M    |         0 |
|        8 | Ms.Mary     |   31 | F    |         0 |
|        9 | Mr.Jonathan |   24 | M    |         0 |
|       10 | Mr.Tommy    |   24 | M    |         0 |
+----------+-------------+------+------+-----------+
8 rows in set (0.00 sec)
```

***
# END